In [7]:
import pandas as pd

In [10]:
names = ['Tuan Anh', 'Duc Nhan', 'Hien Le', 'Gia Binh']

names_pd = pd.Series(names)

names_pd

0    Tuan Anh
1    Duc Nhan
2     Hien Le
3    Gia Binh
dtype: object

In [13]:
studentsWeight = {
    'Hoa': 37,
    'Nam': 48,
    'Hai': 42,
    'Linh': 39,
    'Nhan': 41,
    'Phuong': 38,
    'Thu': 40,
    'Vu': 40,
    'Bao':43
}

In [14]:
studentsWeight_pd = pd.Series(studentsWeight)
print(studentsWeight_pd.mean())
print(studentsWeight_pd.median())
print(studentsWeight_pd.mode())

40.888888888888886
40.0
0    40
dtype: int64

In [15]:
animals = {
    'animal': ['cat', 'dog', 'fish', 'bird'],
    'max_age': [15, 20, 5, 10],
    'type': ['mammal', 'mammal', 'fish', 'bird']
}

animals_df = pd.DataFrame(animals)
animals_df

  animal  max_age    type
0    cat       15  mammal
1    dog       20  mammal
2   fish        5    fish
3   bird       10    bird

In [19]:
animals_df.dtypes

animal     object
max_age     int64
type       object
dtype: object

In [20]:
animals_df.shape

(4, 3)

In [21]:
animals_df.describe()

         max_age
count   4.000000
mean   12.500000
std     6.454972
min     5.000000
25%     8.750000
50%    12.500000
75%    16.250000
max    20.000000

In [22]:
animals_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   animal   4 non-null      object
 1   max_age  4 non-null      int64
 2   type     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [23]:
animals_df.head(1)

  animal  max_age    type
0    cat       15  mammal

In [ ]:
animals_df.tail(2)

  animal  max_age  type
2   fish        5  fish
3   bird       10  bird

In [ ]:
animals_df.to_csv('animals.csv', index=False)

In [28]:
animals_df_read = pd.read_csv('animals.csv')
animals_df_read

  animal  max_age    type
0    cat       15  mammal
1    dog       20  mammal
2   fish        5    fish
3   bird       10    bird

In [29]:
animals_df[0:2]

  animal  max_age    type
0    cat       15  mammal
1    dog       20  mammal

In [32]:
new_df = animals_df[['max_age', 'type']]
new_df[animals_df['max_age'] < 100]

   max_age    type
0       15  mammal
1       20  mammal
2        5    fish
3       10    bird